In [1]:
import pandas as pd
import numpy as np

data = pd.read_csv('transaction_data.csv')
data.head()

,UserId,TransactionId,TransactionTime,ItemCode,ItemDescription,NumberOfItemsPurchased,CostPerItem,Country
0,278166,6355745,Sat Feb 02 12:50:00 IST 2019,465549,FAMILY ALBUM WHITE PICTURE FRAME,6,11.73,United Kingdom
1,337701,6283376,Wed Dec 26 09:06:00 IST 2018,482370,LONDON BUS COFFEE MUG,3,3.52,United Kingdom
2,267099,6385599,Fri Feb 15 09:45:00 IST 2019,490728,SET 12 COLOUR PENCILS DOLLY GIRL,72,0.90,France
3,380478,6044973,Fri Jun 22 07:14:00 IST 2018,459186,UNION JACK FLAG LUGGAGE TAG,3,1.73,United Kingdom
4,-1,6143225,Mon Sep 10 11:58:00 IST 2018,1733592,WASHROOM METAL SIGN,3,3.40,United Kingdom

### Drop Useless columns

In [2]:
cleaned_data = data.drop(['UserId','TransactionTime','Country'], axis=1)

cleaned_data.head()

,TransactionId,ItemCode,ItemDescription,NumberOfItemsPurchased,CostPerItem
0,6355745,465549,FAMILY ALBUM WHITE PICTURE FRAME,6,11.73
1,6283376,482370,LONDON BUS COFFEE MUG,3,3.52
2,6385599,490728,SET 12 COLOUR PENCILS DOLLY GIRL,72,0.90
3,6044973,459186,UNION JACK FLAG LUGGAGE TAG,3,1.73
4,6143225,1733592,WASHROOM METAL SIGN,3,3.40

### Drop Duplicates

In [3]:
cleaned_data = cleaned_data.drop_duplicates()

cleaned_data.shape

(536571, 5)

### Drop Problematic Rows

In [4]:
cleaned_data.drop(cleaned_data[cleaned_data.ItemCode == -1].index, inplace=True)
cleaned_data.drop(cleaned_data[cleaned_data.NumberOfItemsPurchased <= 0].index, inplace=True)
cleaned_data.drop(cleaned_data[cleaned_data.CostPerItem <= 0].index, inplace=True)
cleaned_data.drop(cleaned_data[cleaned_data.CostPerItem > 100000].index, inplace=True)

cleaned_data.shape

(522615, 5)

In [5]:
cleaned_data.head()

,TransactionId,ItemCode,ItemDescription,NumberOfItemsPurchased,CostPerItem
0,6355745,465549,FAMILY ALBUM WHITE PICTURE FRAME,6,11.73
1,6283376,482370,LONDON BUS COFFEE MUG,3,3.52
2,6385599,490728,SET 12 COLOUR PENCILS DOLLY GIRL,72,0.90
3,6044973,459186,UNION JACK FLAG LUGGAGE TAG,3,1.73
4,6143225,1733592,WASHROOM METAL SIGN,3,3.40

In [6]:
cleaned_data.to_csv('final.csv', index=False)